const wordObj = {
  Getaway: "पलायन",
  industrial: "औद्योगिक",
  Economic: "आर्थिक",
  Facility: "सुविधा",
  District: "जिला",
  manufacturing: "विनिर्माण",
  Proposed: "प्रस्तावित",
  President: "अध्यक्ष",
  orderly: "व्यवस्थित",
};

const hindiText = `प्रश्नों के मौखिक उत्तर (प्र.501) …( व्यवधान ) श्री जेसी दिवाकर रेड्डी: अध्यक्ष
महोदया, मुझे यह अवसर देने के लिए आपका बहुत-बहुत धन्यवाद। …( व्यवधान ) पूरा सदन
मुझसे सहमत होगा कि हमारे माननीय के गतिशील नेतृत्व में। प्रधानमंत्री जी का 'मेक
इन इंडिया' का सपना और हमारे माननीय का उद्देश्य। आंध्र प्रदेश के मुख्यमंत्री - जो
हमेशा 'मेक इन आंध्र' के सपने को साकार करने का प्रयास करते हैं - मुझे उम्मीद है,
राष्ट्रीय औद्योगिक और विनिर्माण क्षेत्र (NIMZs), निस्संदेह, भविष्य में सफल
होंगे।… ( व्यवधान ) राष्ट्रीय विनिर्माण नीति में राष्ट्रीय निवेश और विनिर्माण
क्षेत्रों में विनिर्माण उद्योग और पूरे देश में विनिर्माण उद्योग को सुविधा प्रदान
करने के लिए व्यवस्थाएं शामिल हैं, जिसमें विनिर्माण इकाइयों को खुद को समूहों में
व्यवस्थित करने में सक्षम बनाना शामिल है। …( व्यवधान ) वित्तीय वर्ष 2016-17 के
लिए रू. राष्ट्रीय विनिर्माण नीति के कार्यान्वयन की योजना, एनआईएमजेड की मास्टर
प्लानिंग और प्रौद्योगिकी अधिग्रहण और विकास निधि के तहत 3.35 करोड़ रुपये
निर्धारित किए गए हैं। …( व्यवधान ) माननीय जी से मेरा पहला पूरक प्रश्न। मंत्री
महोदया, आपके माध्यम से अध्यक्ष महोदया यह हैं। ये NIMZ दिन का उजाला कब देखेंगे?
जैसा कि आप जानते हैं कि अनंतपुर प्रस्तावित बेंगलुरु-कुरनूल औद्योगिक कॉरिडोर और
सीबीआईसी, यानी चेन्नई-बेंगलुरु औद्योगिक कॉरिडोर का हिस्सा है। क्या अनंतपुर को
एनआईएमजेड में शामिल करने का कोई प्रस्ताव है? क्या इन 22 एनआईएमजेड के पूर्ण
कार्यान्वयन के लिए कोई कार्य योजना या समय सीमा तय की गई है? …( व्यवधान ) श्रीमती
निर्मला सीतारमण: अध्यक्ष महोदया, माननीय। सदस्य ने अनंतपुर जिले के बारे में
प्रश्न पूछा है। … ( व्यवधान ) जैसा कि हम जानते हैं कि दिल्ली-मुंबई इंडस्ट्रियल
कॉरिडोर के तहत आठ जोन कवर किए जा रहे हैं और 14 अन्य, जो दिल्ली-मुंबई इंडस्ट्रियल
कॉरिडोर के बाहर हैं, जोन के रूप में समर्पित हैं, लेकिन कोई नया प्रस्ताव नहीं है।
एक विशेष जिले को शामिल करें, जैसे कि सदस्य ने अनंतपुर का समर्थन किया है। वह या
अन्य को सूची में नया नहीं जोड़ा गया है। …( व्यवधान ) श्री जेसी दिवाकर रेड्डी:
मैडम, अनंतपुर एक पिछड़ा जिला है। यह बेंगलुरु के किनारे और बेंगलुरु के करीब है।
तो, माननीय। मंत्री को अनंतपुर के विकास की चिंता करनी है। …( व्यवधान ) मैं उनसे
अनुरोध करूंगा कि वह वहां एक और जोन प्रस्तावित करें ताकि कपड़ा और कृषि जैसे
उद्योगों को स्थापित करने का अवसर मिल सके। इसलिए माननीय से मेरा विशेष अनुरोध है।
मंत्री कोशिश करें और अनंतपुर को शामिल करें। …( व्यवधान ) ) माननीय। वक्ता: मुझे
खेद है। …( व्यवधान ) माननीय। अध्यक्ष महोदया : सभा पूर्वाह्न 11.20 बजे फिर से
समवेत होने के लिए स्थगित की जाती है लोकसभा फिर ग्यारह बजकर बीस मिनट तक के लिए
स्थगित कर दी गई घड़ी का। प्रश्नों के मौखिक उत्तर .... जारी। श्री जे.सी. दिवाकर
रेड्डी: महोदया, माननीय मंत्री अनंतपुर को अच्छी तरह से जानते हैं। …( व्यवधान )
HON. अध्यक्ष महोदय : नहीं, मैं किसी को अनुमति नहीं दे रहा हूं। …( व्यवधान ) श्री
जे.सी. दिवाकर रेड्डीः अनंतपुर पिछड़ा क्षेत्र है। यह राजस्थान के जैसलमेर जिले से
भी बदतर है क्योंकि औद्योगिक और कृषि के लिहाज से हम बहुत गरीब हैं और बहुत से लोग
वहां से पलायन कर रहे हैं। HON. वक्ता: आपका प्रश्न क्या है? श्री जे.सी. दिवाकर
रेड्डी: जी हां, मैडम, मैं पूछ रहा हूं। वे बैंगलोर, चेन्नई और अन्य स्थानों पर
पलायन कर रहे हैं। दिन-ब-दिन लोगों के वहां से पलायन की समस्या बढ़ती जा रही है,
लेकिन साथ ही हमारे पास वहां बंजर भूमि और अच्छी भूमि भी है। आपके माध्यम से माननीय
मंत्री जी से मेरा इतना ही निवेदन है। मंत्री। उन्होंने प्रकाशम और चित्तूर जिलों
को मान्यता दी है और वहां दो केंद्र दिए हैं। मेरा निवेदन है कि मेरा जिला इन सभी
जिलों से भी बदतर है। आप हमारे लिए एक और केंद्र क्यों नहीं देते? सरकार कुछ खोयेगी
नहीं, बल्कि हमें आर्थिक और आर्थिक रूप से विकसित होने का अवसर देगी। कृपया इसके
लिए मेरे जिले पर विचार करें। श्रीमती निर्मला सीतारमण: माननीय अध्यक्ष महोदया, यह
मुद्दा। सदस्य ने उठाया है निश्चित रूप से बहुत महत्वपूर्ण है क्योंकि अनंतपुर जिला
तेजी से रेगिस्तान बन रहा है। हम यह मानते हैं कि इस जिले में एक कठिनाई है क्योंकि
इसे औद्योगिक रूप से और अन्यथा अपने लोगों के लिए अवसर प्रदान करना है। लेकिन अगर
राज्य सरकार हमें किसी तरह का प्रस्ताव भेजती है, तो हम उस पर विचार कर सकते हैं,
यह उस विभाग पर निर्भर करता है जिसके पास उसे जाना है। इसलिए, यह राज्य सरकार पर
निर्भर है कि वह इसे उठाए। हम निश्चित रूप से इस पर राज्य सरकार के साथ मिलकर काम
करेंगे।
`;

const searching = document.getElementById("searching");
const hindiContent = document.getElementById("hindiContent");
const targetText = document.getElementById("targetText");
const btn = document.getElementById("btn");
const finding = document.getElementById("finding");

btn.addEventListener("click", () => {
  let keys = Object.keys(wordObj)
  let targetSearch = searching.value;
  if (keys.includes(targetSearch)) {

    targetText.innerHTML = wordObj[targetSearch];

    hindiContent.innerHTML = hindiText;

    finding.addEventListener('click',() => {
        let searched = window.find(wordObj[targetSearch])
        console.log(searched)
    })
    

  } else {
    console.log("not working");
  }
});
